# Brewfile - https://github.com/Homebrew/homebrew-bundle
# core applications
tap "homebrew/cask"
tap "homebrew/core"
tap "jabenninghoff/edge"
tap "nrlquaker/createzap"
tap "r-lib/rig"
brew "asciidoc"
brew "checkbashisms"
brew "cmake"
brew "colordiff"
brew "dnsmasq", restart_service: :changed
brew "dos2unix"
brew "fribidi" # required for R pkgdown
brew "gcc" # required for R source packages
brew "gettext" # required for R Matrix
brew "gh"
brew "ghostscript" # optional imagemagick dependency, see: https://github.com/Homebrew/homebrew-core/pull/220197
brew "git"
brew "go"
brew "harfbuzz" # required for R pkgdown
brew "hstr"
brew "imagemagick" # required for R hexSticker
brew "jq"
brew "libgit2" # required for R devtools
brew "librsvg" # rsvg-convert
brew "libomp" # required for R source packages
brew "lorem"
brew "lynx"
brew "mas"
brew "multimarkdown"
brew "nmap"
brew "pandoc"
brew "pcre2" # R mandatory library (https://mac.r-project.org/tools/)
brew "pipenv"
brew "pkgconf" # required for pyenv, rbenv
brew "pwgen"
brew "pyenv"
brew "python" # required for R reticulate
brew "qpdf" # required for R devtools::check
brew "rbenv"
brew "rsync"
brew "ruby"
brew "shellcheck"
brew "speedtest-cli"
brew "sslscan"
brew "tcl-tk" # used by `pyenv install`
brew "tidy-html5"
brew "unar"
brew "vnu"
brew "wget"
brew "xz" # R mandatory library (https://mac.r-project.org/tools/)
brew "yq"
#cask "1password"
#cask "bartender"
cask "coconutbattery"
#cask "daisydisk"
cask "docker-desktop"
cask "font-lato"
cask "github"
cask "imageoptim"
cask "keepingyouawake"
cask "lm-studio"
cask "macsvg"
cask "mactex-no-gui" # R LaTeX support
#cask "microsoft-auto-update"
cask "microsoft-edge"
#cask "microsoft-office"
cask "mitmproxy"
cask "modern-csv"
cask "positron"
cask "qr-journal"
cask "quarto"
cask "r-gfortran" # R mandatory tool (https://mac.r-project.org/tools/)
cask "rig"
cask "rstudio"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"
#mas "iPulse", id: 1028916583
mas "Speedtest", id: 1153157709
mas "Xcode", id: 497799835
vscode "davidanson.vscode-markdownlint"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "idleberg.applescript"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "parallelsdesktop.parallels-desktop"
vscode "rdebugger.r-debugger"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
