# Brewfile - https://github.com/Homebrew/homebrew-bundle
# core applications
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
brew "colordiff"
brew "dnsmasq", restart_service: true
brew "dos2unix"
brew "git"
brew "go"
brew "hstr"
brew "lynx"
#brew "mas"
brew "pandoc"
brew "pwgen"
brew "pyenv"
brew "r"
brew "rbenv"
brew "rsync"
brew "unar"
brew "vnu"
brew "wget"
#cask "1password"
cask "adobe-acrobat-reader"
cask "atom"
cask "caffeine"
cask "coconutbattery"
#cask "daisydisk"
cask "docker"
cask "docker-toolbox"
cask "github"
#cask "google-chrome"
cask "imageoptim"
cask "kitematic"
cask "luna-display"
#cask "luna-secondary"
cask "meld"
#cask "microsoft-auto-update"
#cask "microsoft-office"
#cask "omnigraffle"
cask "qr-journal"
cask "rstudio"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
#cask "webex-meetings"
cask "xquartz"

#mas "iPulse", id: 1028916583
#mas "PCalc", id: 403504866
#mas "Speedtest", id: 1153157709
#mas "Xcode", id: 497799835
